

# 1)

# დავპრინტეთ 4 ტიპის მათემატიკური ოპერაცია: +,-,*,/

print(15 + 17)
print(15 - 17)
print(15 * 17)
print(15 / 17)

# 2)

# შეიქმნა 2 ცვლადი name და age, რომლებსაც მნიშვნელობად გადაეცათ სახელი და ასაკი სტრინგის სახით
name = "Saba"
age = "14"
# დაიპრინტა წინადადება ორივე ცვლადის გამოყენებით
# output: My name is Saba. I am 14 years old
print("My name is", name + ". I am", age , "years old")

# 3)

# ქვემოთ მოცემული კოდი გამოიტანს შეცდომას, რადგან ინტეჯერს(მთელი რიცხვი) ვერ მივუმატებთ სტრინგს(სიმბოლო ბრჭყალებში)

# num1 = 5
# num2 = "5"
# print(num1 + num2) # Error

# 4)

# რა არის ტერმინალი?

# ტერმინალი არის კოდის გაშვების შედეგად მიღებული პასუხი(output)

# 5)
# შეიქმნა 2 ცვლადი num1 და num2, რომლებსაც პარამეტრად გადაეცათ ინტეგერი(integer)

num1 = 13
num2 = 125
# გაცამრავლეთ ამ ორ ცვლადში არსებული რიცხვები ერთმანეთზე და დავპრინტეთ
print(num1 * num2)

# 6)

# რა არის სტრინგი და მთელი რიცხვი?

# სტრინგი არის ტექსტური მონაცემი, რომელიც იწერება ერთმაგ ან ორმაგ ბრჭყალებში

# მთელი რიცხვი(integer) მოიცავს ნატურალურ რიცხვებს ნულისა და უარყოფითი რიცხვების ჩათვლით, ათწილადების და ბრჭყალების გარეშე